/*
 * Задача 12: «Посчитать количество нулей»
 *
 * Напишите функцию countZeros(n), принимающую на вход натуральное число n.
 * Возвращать функция должна суммарное количество нулей, содержащихся во всех числах от 1 до n включительно.
 *
*/

function countZeros(n) {
    
    if (n < 10) return 0;

    const endsWithZero = n - (n % 10);

    return ((endsWithZero + '').split('0').length - 1) + countZeros(endsWithZero - 10);

}

// Протестируйте решение, вызывая функцию с разными аргументами:

console.log(countZeros(22)); // 2 – два нуля, по одному в числах 10 и 20
console.log(countZeros(100)); // 11 – 11 нулей в числах: 10, 20, 30, 40, 50, 60, 70, 80, 90, 100
